tests/Functional/fixtures/creditcard_notify.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<payment xmlns="http://www.elastic-payments.com/schema/payment"
         xmlns:ns2="http://www.elastic-payments.com/schema/epa/transaction">
    <merchant-account-id>53f2895a-e4de-4e82-a813-0d87a10e55e6</merchant-account-id>
    <transaction-id>abcdefgh-abcd-1234-4321-abc123cba321</transaction-id>
    <request-id>1234567890f33e1234567890f0f99e7041234567890ba10141234567890e2166</request-id>
    <transaction-type>purchase</transaction-type>
    <transaction-state>success</transaction-state>
    <completion-time-stamp>2019-01-09T11:16:48.000Z</completion-time-stamp>
    <statuses>
        <status code="201.0000" description="3d-acquirer:The resource was successfully created."
                severity="information"/>
    </statuses>
    <requested-amount currency="EUR">25.000000</requested-amount>
    <parent-transaction-id>12345678-abcd-1234-4321-abc123cba321</parent-transaction-id>
    <account-holder>
        <last-name>Lastname</last-name>
        <email>firstname.lastname@example.com</email>
        <phone>123456789</phone>
        <address>
            <street1>Street</street1>
            <city>Graz</city>
            <country>AT</country>
            <postal-code>8010</postal-code>
        </address>
    </account-holder>
    <shipping>
        <address>
            <street1>Street</street1>
            <city>Graz</city>
            <country>AT</country>
            <postal-code>8010</postal-code>
        </address>
    </shipping>
    <card-token>
        <token-id>1234567890123456</token-id>
        <masked-account-number>401200******1003</masked-account-number>
    </card-token>
    <ip-address>127.0.0.1</ip-address>
    <order-number>145000001</order-number>
    <descriptor>MadisonI145000001</descriptor>
    <notifications format="application/xml">
        <notification url="http://localhost:8000/paymentgateway/gateway/notify/method/creditcard/"/>
    </notifications>
    <custom-fields>
        <custom-field field-name="paysdk_order-id" field-value="1"/>
        <custom-field field-name="elastic-api.merchant-origin" field-value="http://localhost:8000"/>
        <custom-field field-name="elastic-api.ee.original_txn_type" field-value="purchase"/>
    </custom-fields>
    <payment-methods>
        <payment-method name="creditcard"/>
    </payment-methods>
    <parent-transaction-amount currency="EUR">25.000000</parent-transaction-amount>
    <authorization-code>123456</authorization-code>
    <api-id>elastic-api</api-id>
    <locale>en_US</locale>
    <device>
        <fingerprint>098f6bcd4621d373cade4e832627b4f6</fingerprint>
        <policy-score>0</policy-score>
        <type>pc</type>
        <operating-system>linux</operating-system>
    </device>
    <iso>
        <pos-transaction-time>111648</pos-transaction-time>
        <pos-transaction-date>0109</pos-transaction-date>
    </iso>
    <provider-account-id>0000003171820AE0</provider-account-id>
</payment>
