tests/Functional/fixtures/creditcard_return.json

{
  "method": "creditcard",
  "api_id": "elastic-api",
  "authorization_code": "123456",
  "city": "Graz",
  "completion_time_stamp": "20190109105842",
  "country": "AT",
  "descriptor": "MadisonI145000001",
  "device_fingerprint": "098f6bcd4621d373cade4e832627b4f6",
  "device_os": "linux",
  "device_type": "pc",
  "email": "firstname.lastname@example.com",
  "ip_address": "127.0.0.1",
  "last_name": "Lastname",
  "locale": "en_US",
  "masked_account_number": "401200******1003",
  "merchant_account_id": "53f2895a-e4de-4e82-a813-0d87a10e55e6",
  "notification_url_1": "http:\/\/localhost:8000\/paymentgateway\/gateway\/notify\/method\/creditcard\/",
  "order_number": "155000001",
  "parent_transaction_amount": "25.000000",
  "parent_transaction_amount_currency": "EUR",
  "parent_transaction_id": "12345678-abcd-1234-4321-abc123cba321",
  "payment_method": "creditcard",
  "phone": "123456789",
  "postal_code": "8010",
  "request_id": "1234567890f33e1234567890f0f99e7041234567890ba10141234567890e2166",
  "requested_amount": "25.000000",
  "requested_amount_currency": "EUR",
  "response_signature": "sig",
  "response_signature_v2": "SIG",
  "self": "https:\/\/api-test.wirecard.com:443\/engine\/rest\/merchants\/53f2895a-e4de-4e82-a813-0d87a10e55e6\/payments\/abcdefgh-abcd-1234-4321-abc123cba321",
  "shipping_address_city": "Graz",
  "shipping_address_country": "AT",
  "shipping_address_postal_code": "8010",
  "shipping_address_street1": "Street",
  "status_code_1": "201.0000",
  "status_description_1": "3d-acquirer:The resource was successfully created.",
  "status_severity_1": "information",
  "street1": "Street",
  "token_id": "1234567890123456",
  "transaction_id": "abcdefgh-abcd-1234-4321-abc123cba321",
  "transaction_state": "success",
  "transaction_type": "purchase",
  "jsresponse": "true"
}
